ИС_СПОРТ_2022/src/InformationRegisters/КадровыеИсторииТренеров/КадровыеИсторииТренеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадровыеИсторииТренеров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ТренерПреподователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Enums/ВидЗанятости/ВидЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЗанятости</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/InformationRegisters/КадровыеИсторииТренеров/Forms/ФормаЗаписи/Module.bsl
// {Рарус ivaart IN-19101 Кадровая история тренеров. Обработка открытия записи регистра 2021.08.19
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") И НЕ ПустаяСтрока(Параметры.Организация) тогда
		Запись.Организация = Параметры.Организация;
		Элементы.Организация.ТолькоПросмотр = Истина;
	ИначеЕсли Не ПустаяСтрока(Запись.Организация) и РольДоступна("Методист") тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Тренер") И НЕ ПустаяСтрока(Параметры.Тренер) тогда
		Запись.Тренер = Параметры.Тренер;
		Элементы.Тренер.ТолькоПросмотр = Истина;
	ИначеЕсли Не ПустаяСтрока(Запись.Тренер) и РольДоступна("Методист") тогда
		Элементы.Тренер.ТолькоПросмотр = Истина;
	КонецЕсли;
	// {Рарус dotere #22661 -Изменение вида записи 2021.12.08
	Если Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Элементы.ТренерПреподователь.Видимость = Ложь;
		Элементы.ВидЗанятости.Видимость = Ложь;
	КонецЕсли
	// }Рарус dotere #22661 -Изменение вида записи 2021.12.08
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуТренера(Тренер)
	Возврат Тренер.Ссылка;
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбнавлёнСтатусТренера"+СтрЗаменить(ПолучитьСсылкуТренера(Запись.Тренер), " ", ""));
КонецПроцедуры

// {Рарус dotere #22661 -Изменение вида записи 2021.12.08
&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Если Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ПустаяСсылка();
		Запись.ТренерПреподователь = Ложь;
		Элементы.ВидЗанятости.Видимость = Ложь;
		Элементы.ТренерПреподователь.Видимость = Ложь;
	Иначе
		Элементы.ВидЗанятости.Видимость = Истина;
		Элементы.ТренерПреподователь.Видимость = Истина;
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ОсновноеМестоРаботы;
	КонецЕсли
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Запись.ВидЗанятости.Пустая() И Не Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ОсновноеМестоРаботы;
	КонецЕсли
КонецПроцедуры
// }Рарус dotere #22661 -Изменение вида записи 2021.12.08
// }Рарус ivaart IN-19101 Кадровая история тренеров. Обработка открытия записи регистра 2021.08.19
